### 常用操作

In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({'group':['a','b','c']*3,
                     'data':range(0,9)})
data

   data group
0     0     a
1     1     b
2     2     c
3     3     a
4     4     b
5     5     c
6     6     a
7     7     b
8     8     c

In [3]:
data.sort_values(by=['group', 'data'], ascending=[False,True], inplace=True)
data

   data group
2     2     c
5     5     c
8     8     c
1     1     b
4     4     b
7     7     b
0     0     a
3     3     a
6     6     a

In [4]:
data = pd.DataFrame({'k1':['one']*3+['two']*4,
                    'k2':[3,2,1,3,3,4,4,]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [5]:
data.sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [6]:
data.drop_duplicates()

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

In [7]:
data.drop_duplicates(subset='k1')

    k1  k2
0  one   3
3  two   3

In [8]:
data = pd.DataFrame({'food':['A1','A2','B1','B2','B3','C1','C2'],
                     'data':range(1,8)})
data

   data food
0     1   A1
1     2   A2
2     3   B1
3     4   B2
4     5   B3
5     6   C1
6     7   C2

In [9]:
def food_map(series):
    if series['food'] in ['A1','A2']:
        return 'A'
    elif series['food'] in ['B1','B2','B3']:
        return 'B'
    elif series['food'] in ['C1', 'C2']:
        return 'C'
    else:
        pass
    
data['food_map'] = data.apply(food_map, axis='columns')
data

   data food food_map
0     1   A1        A
1     2   A2        A
2     3   B1        B
3     4   B2        B
4     5   B3        B
5     6   C1        C
6     7   C2        C

In [10]:
food2Upper = {
    'A1': 'A',
    'A2': 'A',
    'B1': 'B',
    'B2': 'B',
    'B3': 'B',
    'C1': 'C',
    'C2': 'C'
}
data['upper'] = data['food'].map(food2Upper)
data

   data food food_map upper
0     1   A1        A     A
1     2   A2        A     A
2     3   B1        B     B
3     4   B2        B     B
4     5   B3        B     B
5     6   C1        C     C
6     7   C2        C     C

In [11]:
import numpy as np
df = pd.DataFrame({'data1':np.random.randn(5),
                  'data2':np.random.randn(5)})
df2 = df.assign(ration=df['data1']/df['data2'])
df2

      data1     data2    ration
0 -0.252071  1.527255 -0.165048
1 -0.396033  0.677511 -0.584541
2  0.424982  0.487569  0.871634
3 -1.037269  0.383663 -2.703595
4  0.361643  0.210084  1.721423

In [12]:
df2.drop('ration', axis='columns', inplace=True)

In [13]:
df2

      data1     data2
0 -0.252071  1.527255
1 -0.396033  0.677511
2  0.424982  0.487569
3 -1.037269  0.383663
4  0.361643  0.210084

In [14]:
data=pd.Series(range(1,10))
data

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [15]:
data.replace(9,np.nan,inplace=True)

In [16]:
data

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
8    NaN
dtype: float64

In [17]:
ages = [15,18,20,21,22,34,41,52,63,79]
bins = [10,40,80]
bins_res = pd.cut(ages,bins)
bins_res

[(10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (40, 80], (40, 80], (40, 80], (40, 80]]
Categories (2, interval[int64]): [(10, 40] < (40, 80]]

In [18]:
bins_res.codes

array([0, 0, 0, 0, 0, 0, 1, 1, 1, 1], dtype=int8)

In [19]:
pd.value_counts(bins_res)

(10, 40]    6
(40, 80]    4
dtype: int64

In [20]:
pd.cut(ages,[10,30,50,80])

[(10, 30], (10, 30], (10, 30], (10, 30], (10, 30], (30, 50], (30, 50], (50, 80], (50, 80], (50, 80]]
Categories (3, interval[int64]): [(10, 30] < (30, 50] < (50, 80]]

In [21]:
group_names = ['Youth', 'Mille', 'Old']
pd.value_counts(pd.cut(ages,[10,20,50,80],labels=group_names))

Mille    4
Old      3
Youth    3
dtype: int64

In [22]:
df = pd.DataFrame([range(3),
                   [0,np.nan,0],
                  [0,0,np.nan],
                  range(3)])
df

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [23]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [24]:
df.isnull().any()

0    False
1     True
2     True
dtype: bool

In [25]:
df.isnull().any(axis=1)

0    False
1     True
2     True
3    False
dtype: bool

In [26]:
df.fillna(5)

   0    1    2
0  0  1.0  2.0
1  0  5.0  0.0
2  0  0.0  5.0
3  0  1.0  2.0

In [27]:
df[df.isnull().any(axis=1)]

   0    1    2
1  0  NaN  0.0
2  0  0.0  NaN

In [42]:
df1 = pd.DataFrame([[1, 2], [3, 4]], columns=['a', ''])
df1

   a
0  1  2
1  3  4

In [43]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
df2

   A  B
0  5  6
1  7  8

In [45]:
# df = df1.append(df2)
df = pd.concat([df1, df2])
df

/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

          A    B    a
0  2.0  NaN  NaN  1.0
1  4.0  NaN  NaN  3.0
0  NaN  5.0  6.0  NaN
1  NaN  7.0  8.0  NaN